{
  "unique_id": "867552d3-cc65-5eaa-ae3a-7b4511923017",
  "title": "Armando Solar-Lezama named inaugural Distinguished Professor of Computing",
  "description": "EECS professor appointed to new professorship in the MIT Schwarzman College of Computing.",
  "link": "https://news.mit.edu/2023/armando-solar-lezama-named-inaugural-distinguished-college-computing-professor-0717",
  "blog_text": "The MIT Stephen A. Schwarzman College of Computing named Armando Solar-Lezama as the inaugural Distinguished Professor of Computing, effective July 1. \nSolar-Lezama is the first person appointed to this position generously endowed by Professor Jae S. Lim of the Department of Electrical Engineering and Computer Science (EECS). Established in the MIT Schwarzman College of Computing, the chair is being awarded to Solar-Lezama for being an outstanding faculty member who is recognized as a leader and innovator.\n“I’m pleased to make this appointment and recognize Armando for his remarkable contributions to MIT and the scientific community,” says Daniel Huttenlocher, dean of the MIT Schwarzman College of Computing and the Henry Ellis Warren Professor of Electrical Engineering and Computer Science. “I’m greatly appreciative of Professor Lim for his thoughtful gesture in creating this new chair in the college, providing us with the opportunity to acknowledge the accomplishments of our faculty.”\nSolar-Lezama, a professor of electrical engineering and computer science, leads the Computer-Aided Programming Group in the Computer Science and Artificial Intelligence Laboratory (CSAIL) that focuses on program synthesis, an area of research that lies at the intersection of programming systems and artificial intelligence. The group’s research ranges from designing new analysis techniques and automated reasoning mechanisms to developing new programming models that automate challenging aspects of programming.\nA member of the EECS faculty since 2008, Solar-Lezama, who also serves as the associate director and chief operating officer for CSAIL, is most interested in software synthesis and its applications to particular program domains such as high-performance computing. He first found this niche area of program synthesis as a graduate student at the University of California at Berkeley, for which his thesis project, a language called Sketch, treats program synthesis as a search problem in which the algorithms pare down the search space to make the search faster and more efficient. Since then, program synthesis research has greatly expanded into the active field it is today.\n",
  "published": "2023-07-17",
  "timestamp": "2023-08-22T12:35:42.577219"
}