{
  "unique_id": "ecd4efda-8dc8-53ed-8c69-95b83fd7c568",
  "title": "David Autor named NOMIS 2023 Distinguished Scientist",
  "description": "NOMIS Foundation honors the Ford Professor of Economics for his contributions to understanding the effects of technological change and globalization on jobs and earnings prospects for workers.",
  "link": "https://news.mit.edu/2023/david-autor-named-nomis-distinguished-scientist-0614",
  "blog_text": "David H. Autor, Ford Professor of Economics at MIT, has been recognized as one of two 2023 NOMIS Distinguished Scientists for his significant contributions and ongoing research work to understand the effects of technological change and globalization on jobs and earnings prospects for workers. Anne Brunet of Stanford University is the other winner for this year.\nThe NOMIS Distinguished Scientist and Scholar Award is presented by the NOMIS Foundation to researchers who, through their innovative, groundbreaking research, have made a significant contribution to their respective fields, and who inspire the world around them.\nIn addition to co-directing the MIT Shaping the Future of Work Initiative, MIT Blueprint Labs, and the National Bureau of Economic Research's Labor Studies Program, Autor will lead the NOMIS Foundation's Expertise project, which seeks to answer a looming question about the impact of new technologies like generative AI: “Will new technologies complement or commodify expertise?”\nJoshua Angrist, Ford Professor of Economics at MIT, recipient of the 2021 Nobel Prize in Economics, and co-founder and director of MIT Blueprint Labs, responded to the announcement of the award with praise for Autor’s ongoing research: “David’s labor market research has produced unparalleled insights into how our world works. His careful scholarship documents the consequences of major new forces, such as the China trade shock, and slowly evolving trends, like automation. He melds careful theoretical reasoning and state-of-the-art causal inference tools with unmatched skill to address big economic questions. David’s answers, always explained with grace and humor, reassure those inclined to panic in the face of the unknown, while also helping us all prepare for a changed future. It’s a privilege to be his colleague, coauthor, and friend.”\n“This is a moment of celebration for the very well-deserved recognition of David Autor's enormous contributions to labor economics and our understanding of some of the most important trends of the age,” says Daron Acemolgu, MIT Institute professor and Autor’s fellow faculty co-director of the MIT Shaping the Future of Work Initiative. “It is not an exaggeration to say that David has revolutionized our thinking on not just one, but several topics, including the effects of imports from China, the inequality and job implications of computers and automation, and the consequences of new human resource practices and work arrangements. David has been more than a trailblazing researcher. He is also a dedicated advisor and an amazing, generous colleague. The entire labor economics profession, and especially our community at MIT, is fortunate to have had an opportunity to interact with him and learn from him. I am personally looking forward to doing so for many more years.”\nThe 2023 NOMIS Awards will be presented in Zurich, Switzerland, this October. \n",
  "published": "2023-06-14",
  "timestamp": "2023-08-22T12:35:42.602555"
}