{
  "unique_id": "34c91399-8efe-5e1a-a283-8c9a366165f0",
  "title": "Defining the public interest in new technologies",
  "description": "New online journal seeks to bring together the MIT community to discuss the social responsibilities of individuals who design, implement, and evaluate technologies.",
  "link": "https://news.mit.edu/2023/defining-public-interest-new-technologies-0613",
  "blog_text": "How are waves of disruptive technologies, such as more advanced versions of artificial intelligence systems, changing the way we work, live, and play? Are there pathways that academics, practitioners, innovators, and entrepreneurs ought to be pursuing to ensure that the largest share of the benefits associated with new technologies uplift the most marginalized populations? What professional training is needed to ensure that this happens? What responsibility do creators of new or repurposed technologies have when they, and their organizations, create products or systems that might have adverse societal consequences? We are in an era in need of clear professional guidelines and norms, to say nothing of laws and regulations regarding the social impacts of new technologies.\nPublic interest technology, as an emerging field, aims to help shift the scholarly focus from the technologies to the technologists. To support this nascent field, students, faculty, and staff at MIT are launching a conversation to encourage technologists from different fields to confront the ethical and moral dilemmas that require them to redefine best practices in the face of ever-changing societal needs and norms. \nThe Public Interest Technologist (TPIT) is a new online publication that seeks to bring together the MIT community to define and discuss the social responsibilities of individuals who design, implement, and evaluate technologies, especially in new fields. The editorial team for this publication has identified public interest technology as a new multidisciplinary field that emphasizes the benefits that could flow from both old and new technologies as they are developed in the most responsible fashion.\n“As the pace of technology innovation quickens, the impacts, often unexpected, of new technologies generate gains and losses. Past experience with technological innovation has demonstrated that those diverse gains and losses are distributed unequally,” says Lawrence Susskind, the Ford Professor of Urban and Environmental Planning at the MIT Department of Urban Studies and Planning and a member of TPIT’s editorial team. “I think that those of us who care, and those of us with leadership roles in this field, have a responsibility to take concerted action to minimize the most harmful effects while ensuring that benefits reach those most in need. We see this publication as a means to move in this direction.” \nFraming the public interest in tech design and development\nAs one example of technology’s recent impact on society, the Covid-19 pandemic dramatically changed how we work and commute. Among other shifts, public transit agencies have been forced to contend with a new normal.\nIn an interview with Emilie Flamme, an MIT graduate student in city planning and a TPIT editor, Jim Aloisi and Jinhua Zhao of MIT's Transit Lab propose a way: “to modernize and optimize transit for a labor workforce currently experiencing shortages. To implement this process, they underscore that defining the public interest involves co-defining questions that public agencies and staff must answer with the public. Aloisi and Zhao note that their Transit Lab emphasizes the question of what is in the public interest. Public technology is at the heart of the work they do, and Zhao wonders whether students receiving technological training get enough exposure and education regarding the public interest.\nFostering conversations, both at MIT and beyond\nAt MIT, TPIT’s editorial team seeks to provoke a campus-wide conversation: How do public interest technologists define their social responsibilities? Is it reasonable to assume that those who invent or implement new technologies will take some responsibility for the impacts or effects these technologies have? Who should decide what these responsibilities should be? Do norms need to be enforced?\nMembers of 63 universities, including MIT, have formed a coalition with the support of New America Foundation to share ideas about public interest technology (PIT). Should it be the focus of new degree programs? What research questions regarding PIT deserve the highest priority? The PIT-UN coalition provides grants and organizes an annual convening, including the 2023 PIT-UN Convening at Boston University in October. The Public Interest Technologist is an extension of MIT’s involvement with the PIT-UN network.\nThe editorial team at TPIT hopes to involve all MIT community members in shaping its current and future content. The team invites nominations for prospective interviewees from across the MIT community, article suggestions, and already published materials that will support a broader discussion of public interest technology at MIT. Community members are also invited to attend the PIT-UN annual meeting at Boston University this fall.\n",
  "published": "2023-06-13",
  "timestamp": "2023-08-22T12:35:42.603778"
}