{
  "unique_id": "2a69bb8c-57cc-5ddf-99f9-1e63bf1e5c4e",
  "title": "Envisioning the future of computing",
  "description": "MIT students share ideas, aspirations, and vision for how advances in computing stand to transform society in a competition hosted by the Social and Ethical Responsibilities of Computing.",
  "link": "https://news.mit.edu/2023/envisioning-future-computing-0616",
  "blog_text": "How will advances in computing transform human society?\nMIT students contemplated this impending question as part of the Envisioning the Future of Computing Prize — an essay contest in which they were challenged to imagine ways that computing technologies could improve our lives, as well as the pitfalls and dangers associated with them.\nOffered for the first time this year, the Institute-wide competition invited MIT undergraduate and graduate students to share their ideas, aspirations, and vision for what they think a future propelled by advancements in computing holds. Nearly 60 students put pen to paper, including those majoring in mathematics, philosophy, electrical engineering and computer science, brain and cognitive sciences, chemical engineering, urban studies and planning, and management, and entered their submissions.\nStudents dreamed up highly inventive scenarios for how the technologies of today and tomorrow could impact society, for better or worse. Some recurring themes emerged, such as tackling issues in climate change and health care. Others proposed ideas for particular technologies that ranged from digital twins as a tool for navigating the deluge of information online to a cutting-edge platform powered by artificial intelligence, machine learning, and biosensors to create personalized storytelling films that help individuals understand themselves and others.\nConceived of by the Social and Ethical Responsibilities of Computing (SERC), a cross-cutting initiative of the MIT Schwarzman College of Computing in collaboration with the School of Humanities, Arts, and Social Sciences (SHASS), the intent of the competition was “to create a space for students to think in a creative, informed, and rigorous way about the societal benefits and costs of the technologies they are or will be developing,” says Caspar Hare, professor of philosophy, co-associate dean of SERC, and the lead organizer of the Envisioning the Future of Computing Prize. “We also wanted to convey that MIT values such thinking.”\nPrize winners\nThe contest implemented a two-stage evaluation process wherein all essays were reviewed anonymously by a panel of MIT faculty members from the college and SHASS for the initial round. Three qualifiers were then invited to present their entries at an awards ceremony on May 8, followed by a Q&A with a judging panel and live in-person audience for the final round.\nThe winning entry was awarded to Robert Cunningham '23, a recent graduate in math and physics, for his paper on the implications of a personalized language model that is fine-tuned to predict an individual’s writing based on their past texts and emails. Told from the perspective of three fictional characters: Laura, founder of the tech startup ScribeAI, and Margaret and Vincent, a couple in college who are frequent users of the platform, readers gained insights into the societal shifts that take place and the unforeseen repercussions of the technology.\nCunningham, who took home the grand prize of $10,000, says he came up with the concept for his essay in late January while thinking about the upcoming release of GPT-4 and how it might be applied. Created by the developers of ChatGPT — an AI chatbot that has managed to capture popular imagination for its capacity to imitate human-like text, images, audio, and code — GPT-4, which was unveiled in March, is the newest version of OpenAI’s language model systems.\n“GPT-4 is wild in reality, but some rumors before it launched were even wilder, and I had a few long plane rides to think about them! I enjoyed this opportunity to solidify a vague notion into a piece of writing, and since some of my favorite works of science fiction are short stories, I figured I'd take the chance to write one,” Cunningham says.\nThe other two finalists, awarded $5,000 each, included Gabrielle Kaili-May Liu '23, a recent graduate in mathematics with computer science, and brain and cognitive sciences, for her entry on using the reinforcement learning with human feedback technique as a tool for transforming human interactions with AI; and Abigail Thwaites and Eliot Matthew Watkins, graduate students in the Department of Philosophy and Linguistics, for their joint submission on automatic fact checkers, an AI-driven software that they argue could potentially help mitigate the spread of misinformation and be a profound social good.\n“We were so excited to see the amazing response to this contest. It made clear how much students at MIT, contrary to stereotype, really care about the wider implications of technology, says Daniel Jackson, professor of computer science and one of the final-round judges. “So many of the essays were incredibly thoughtful and creative. Robert’s story was a chilling, but entirely plausible take on our AI future; Abigail and Eliot’s analysis brought new clarity to what harms misinformation actually causes; and Gabrielle’s piece gave a lucid overview of a prominent new technology. I hope we’ll be able to run this contest every year, and that it will encourage all our students to broaden their perspectives even further.”\nFellow judge Graham Jones, professor of anthropology, adds: “The winning entries reflected the incredible breadth of our students’ engagement with socially responsible computing. They challenge us to think differently about how to design computational technologies, conceptualize social impacts, and imagine future scenarios. Working with a cross-disciplinary panel of judges catalyzed lots of new conversations. As a sci-fi fan, I was thrilled that the top prize went to a such a stunning piece of speculative fiction!”\nOther judges on the panel for the final round included:\n\nDan Huttenlocher, dean of the MIT Schwarzman College of Computing;\nAleksander Madry, Cadence Design Systems Professor of Computer Science;\nAsu Ozdaglar, deputy dean of academics for the MIT Schwarzman College of Computing and head of the Department of Electrical Engineering and Computer Science;\nGeorgia Perakis, co-associate dean of SERC and the William F. Pounds Professor of Management; and\nAgustin Rayo, dean of the MIT School of Humanities, Arts, and Social Sciences.\n\nHonorable mentions\nIn addition to the grand prize winner and runners up, 12 students were recognized with honorable mentions for their entries, with each receiving $500.\nThe honorees and the title of their essays include:\n\nAlexa Reese Canaan, Technology and Policy Program, “A New Way Forward: The Internet & Data Economy”;\nFernanda De La Torre Romo, Department of Brain and Cognitive Sciences, “The Empathic Revolution Using AI to Foster Greater Understanding and Connection”;\nSamuel Florin, Department of Mathematics, \"Modeling International Solutions for the Climate Crisis\";\nClaire Gorman, Department of Urban Studies and Planning (DUSP), “Grounding AI — Envisioning Inclusive Computing for Soil Carbon Applications”;\nKevin Hansom, MIT Sloan School of Management, “Quantum Powered Personalized Pharmacogenetic Development and Distribution Model”;\nSharon Jiang, Department of Electrical Engineering and Computer Science (EECS), “Machine Learning Driven Transformation of Electronic Health Records”;\nCassandra Lee, Media Lab, “Considering an Anti-convenience Funding Body”;\nMartin Nisser, EECS, \"Towards Personalized On-Demand Manufacturing\";\nAndi Qu, EECS, \"Revolutionizing Online Learning with Digital Twins\";\nDavid Bradford Ramsay, Media Lab, “The Perils and Promises of Closed Loop Engagement”;\nShuvom Sadhuka, EECS, “Overcoming the False Trade-off in Genomics: Privacy and Collaboration”; and\nLeonard Schrage, DUSP, “Embodied-Carbon-Computing.”\n\nThe Envisioning the Future of Computing Prize was supported by MAC3 Impact Philanthropies.\n",
  "published": "2023-06-16",
  "timestamp": "2023-08-22T12:35:42.599158"
}