{
  "unique_id": "c709b2dc-8d59-5dce-85c6-b3642aa7c54b",
  "title": "Three Spanish MIT physics postdocs receive Botton Foundation fellowships",
  "description": "Recipients Luis Antonio Benítez, Carolina Cuesta-Lazaro, and Fernando Romero López receive support for their scientific research.",
  "link": "https://news.mit.edu/2023/botton-foundation-fellowships-spanish-mit-physics-postdocs-0609",
  "blog_text": "Three Spanish MIT postdocs, Luis Antonio Benítez, Carolina Cuesta-Lazaro, and Fernando Romero López, were chosen by the Department of Physics as the first cohort of Mauricio and Carlota Botton Foundation Fellows.\nThis year’s recipients are provided with a one-year stipend and a research fund to pursue their research interests; they will visit the Botton Foundation in Madrid this summer.\nL. Antonio Benítez\nA dual citizen of Spain and Colombia, L. Antonio Benítez is an MIT postdoc whose research focuses on the investigation of the electronic properties of novel quantum materials, with a particular emphasis on two-dimensional materials like graphene and transition metal dichalcogenides. His work aims to push the boundaries of our knowledge of these materials and unlock their full potential for future technologies. Benítez received his PhD in physics from the Autonomous University of Barcelona, where he specialized in the spin and electronic properties of these materials, developing a deep understanding of their unique characteristics and behavior.  \nCarolina Cuesta-Lazaro \nCarolina Cuestra-Lazaro’s main research interests lie on the intersection of cosmology and artificial intelligence. She is interested in developing robust and interpretable machine-learning models for advancement in physics, especially for developing techniques for cosmological inference to understand the accelerated expansion of the universe. She received her PhD in astronomy and astrophysics at the Institute for Computational Cosmology, and now holds a shared position between MIT’s Institute for Artificial Intelligence and Fundamental Interactions and Harvard University’s Institute for Theory and Computation at the Center for Astrophysics. Cuestra-Lazaro hails from Cuenca, where she says “You can find some of the best Manchego cheese.”\nFernando Romero López  \nRomero-López completed his PhD in 2021 at the University of Valencia. As a postdoc, his research focuses on understanding the strong interactions among quarks and gluons, described by quantum chromodynamics (QCD). By combining effective field theories with numerical simulations of quantum field theories (lattice QCD) and machine-learning tools, he is seeking a better understanding of the mechanisms of confinement, how protons, neutrons, and other hadrons are formed, the properties of atomic nuclei, and the nature of exotic hadrons that have been detected at the Large Hadron Collider.\nThe foundation also recently funded scholarships for two PhD physics students at MIT: Oriol Rubies Bigorda, who is researching the physics of interacting quantum particles and their applications in future quantum technologies, and Miguel Calvo Carrera, who is interested in the application of physics to develop renewable energy sources.\nEstablished in 2017, the Mauricio and Carlota Botton Foundation supports scientific research, including the training of young physicists in the most prestigious universities in the world, and to provide support for conferences that bring world experts in the frontier fields of physics to Spain.\n",
  "published": "2023-06-09",
  "timestamp": "2023-08-22T12:35:42.606731"
}